[Killed] BlockStatement
src/backtrack.js:6:45
 
 // sudokuUtils.js
 
-export function getElement(board, row, col) {
-	if (
-		row < 0 ||
-		row >= board.length ||
-		col < 0 ||
-		col >= board[0].length
-	) {
-		throw new Error("Index out of bounds");
-	}
-
-	return board[row][col];
-}
+export function getElement(board, row, col) {}
 
 export function putElement(board, row, col, val) {
killedBy: backtrack correct getElement
statusReason: expected undefined to equal 6

[Killed] ConditionalExpression
src/backtrack.js:8:3
 
 export function getElement(board, row, col) {
 	if (
-		row < 0 ||
-		row >= board.length ||
-		col < 0 ||
-		col >= board[0].length
+		false
 	) {
 		throw new Error("Index out of bounds");
killedBy: backtrack correct getElement
statusReason: expected 42 to equal 6

[Killed] ConditionalExpression
src/backtrack.js:8:3
 
 export function getElement(board, row, col) {
 	if (
-		row < 0 ||
-		row >= board.length ||
-		col < 0 ||
+		false ||
 		col >= board[0].length
 	) {
killedBy: backtrack correct getElement
statusReason: expected 42 to equal 6

[Killed] ConditionalExpression
src/backtrack.js:9:3
 export function getElement(board, row, col) {
 	if (
 		row < 0 ||
-		row >= board.length ||
+		false ||
 		col < 0 ||
 		col >= board[0].length
killedBy: backtrack case 3b: getElement 
statusReason: expected [Function] to throw error including 'Index out of bounds' but got 'Cannot read properties of undefined (…'

[Killed] EqualityOperator
src/backtrack.js:9:3
 export function getElement(board, row, col) {
 	if (
 		row < 0 ||
-		row >= board.length ||
+		row < board.length ||
 		col < 0 ||
 		col >= board[0].length
killedBy: backtrack correct getElement
statusReason: Index out of bounds

[Killed] ConditionalExpression
src/backtrack.js:10:3
 	if (
 		row < 0 ||
 		row >= board.length ||
-		col < 0 ||
+		false ||
 		col >= board[0].length
 	) {
killedBy: backtrack case 2b: getElement 
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/backtrack.js:10:3
 	if (
 		row < 0 ||
 		row >= board.length ||
-		col < 0 ||
+		col >= 0 ||
 		col >= board[0].length
 	) {
killedBy: backtrack correct getElement
statusReason: Index out of bounds

[Killed] ConditionalExpression
src/backtrack.js:11:3
 		row < 0 ||
 		row >= board.length ||
 		col < 0 ||
-		col >= board[0].length
+		false
 	) {
 		throw new Error("Index out of bounds");
killedBy: backtrack correct getElement
statusReason: expected 42 to equal 6

[Killed] EqualityOperator
src/backtrack.js:11:3
 		row < 0 ||
 		row >= board.length ||
 		col < 0 ||
-		col >= board[0].length
+		col > board[0].length
 	) {
 		throw new Error("Index out of bounds");
killedBy: backtrack case 4b: getElement 
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/backtrack.js:12:4
 		row >= board.length ||
 		col < 0 ||
 		col >= board[0].length
-	) {
-		throw new Error("Index out of bounds");
-	}
+	) {}
 
 	return board[row][col];
killedBy: backtrack case 1b: getElement 
statusReason: expected [Function] to throw error including 'Index out of bounds' but got 'Cannot read properties of undefined (…'

[Killed] StringLiteral
src/backtrack.js:13:19
 		col < 0 ||
 		col >= board[0].length
 	) {
-		throw new Error("Index out of bounds");
+		throw new Error("");
 	}
 
killedBy: backtrack case 1b: getElement 
statusReason: expected [Function] to throw error including 'Index out of bounds' but got ''

[Killed] BlockStatement
src/backtrack.js:19:50
 	return board[row][col];
 }
 
-export function putElement(board, row, col, val) {
-	if (
-		row < 0 ||
-		row >= board.length ||
-		col < 0 ||
-		col >= board[0].length
-	) {
-		throw new Error("Index out of bounds");
-	}
-
-	board[row][col] = val;
-	return true;
-}
+export function putElement(board, row, col, val) {}
 
 // Check if placing 'num' in the given 'row' causes a clash
killedBy: backtrack case 1a: putElement
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/backtrack.js:21:3
 
 export function putElement(board, row, col, val) {
 	if (
-		row < 0 ||
+		row >= 0 ||
 		row >= board.length ||
 		col < 0 ||
killedBy: backtrack correct putElement
statusReason: Index out of bounds

[Killed] EqualityOperator
src/backtrack.js:23:3
 	if (
 		row < 0 ||
 		row >= board.length ||
-		col < 0 ||
+		col <= 0 ||
 		col >= board[0].length
 	) {
killedBy: backtrack case 3a: putElement
statusReason: Index out of bounds

[Killed] EqualityOperator
src/backtrack.js:24:3
 		row < 0 ||
 		row >= board.length ||
 		col < 0 ||
-		col >= board[0].length
+		col < board[0].length
 	) {
 		throw new Error("Index out of bounds");
killedBy: backtrack correct putElement
statusReason: Index out of bounds

[Killed] BooleanLiteral
src/backtrack.js:30:9
 	}
 
 	board[row][col] = val;
-	return true;
+	return false;
 }
 
killedBy: backtrack case 1c: putElement
statusReason: expected false to equal true

[Killed] BlockStatement
src/backtrack.js:34:46
 }
 
 // Check if placing 'num' in the given 'row' causes a clash
-export function hasRowClash(board, row, num) {
-	for (let d = 0; d < board[row].length; d++) {
-		if (getElement(board, row, d) == num) {
-			return true;
-		}
-	}
-	return false;
-}
+export function hasRowClash(board, row, num) {}
 
 // Check if placing 'num' in the given 'col' causes a clash
killedBy: backtrack case 1 
statusReason: expected '3165284265291345974876798312434127829…' to equal '3165784925291347684876295312634159879…'

[Killed] ConditionalExpression
src/backtrack.js:35:18
 
 // Check if placing 'num' in the given 'row' causes a clash
 export function hasRowClash(board, row, num) {
-	for (let d = 0; d < board[row].length; d++) {
+	for (let d = 0; false; d++) {
 		if (getElement(board, row, d) == num) {
 			return true;
killedBy: backtrack case 1 
statusReason: expected '3165284265291345974876798312434127829…' to equal '3165784925291347684876295312634159879…'

[Killed] BlockStatement
src/backtrack.js:35:46
 
 // Check if placing 'num' in the given 'row' causes a clash
 export function hasRowClash(board, row, num) {
-	for (let d = 0; d < board[row].length; d++) {
-		if (getElement(board, row, d) == num) {
-			return true;
-		}
-	}
+	for (let d = 0; d < board[row].length; d++) {}
 	return false;
 }
killedBy: backtrack case 1 
statusReason: expected '3165284265291345974876798312434127829…' to equal '3165784925291347684876295312634159879…'

[Killed] BlockStatement
src/backtrack.js:36:41
 // Check if placing 'num' in the given 'row' causes a clash
 export function hasRowClash(board, row, num) {
 	for (let d = 0; d < board[row].length; d++) {
-		if (getElement(board, row, d) == num) {
-			return true;
-		}
+		if (getElement(board, row, d) == num) {}
 	}
 	return false;
killedBy: backtrack case 1 
statusReason: expected '3165284265291345974876798312434127829…' to equal '3165784925291347684876295312634159879…'

[Killed] EqualityOperator
src/backtrack.js:36:7
 // Check if placing 'num' in the given 'row' causes a clash
 export function hasRowClash(board, row, num) {
 	for (let d = 0; d < board[row].length; d++) {
-		if (getElement(board, row, d) == num) {
+		if (getElement(board, row, d) != num) {
 			return true;
 		}
killedBy: backtrack case 1 
statusReason: expected null to equal '3165784925291347684876295312634159879…'

[Killed] BooleanLiteral
src/backtrack.js:37:11
 export function hasRowClash(board, row, num) {
 	for (let d = 0; d < board[row].length; d++) {
 		if (getElement(board, row, d) == num) {
-			return true;
+			return false;
 		}
 	}
killedBy: backtrack case 1 
statusReason: expected '3165284265291345974876798312434127829…' to equal '3165784925291347684876295312634159879…'

[Killed] BlockStatement
src/backtrack.js:44:46
 }
 
 // Check if placing 'num' in the given 'col' causes a clash
-export function hasColClash(board, col, num) {
-	for (let r = 0; r < board.length; r++) {
-		if (getElement(board, r, col) === num) {
-			return true;
-		}
-	}
-	return false;
-}
+export function hasColClash(board, col, num) {}
 
 // Check if placing 'num' in the given 'row' and 'col' causes a clash within the square
killedBy: backtrack case 1 
statusReason: expected '3165784295241396789872465312634157899…' to equal '3165784925291347684876295312634159879…'

[Killed] BlockStatement
src/backtrack.js:45:41
 
 // Check if placing 'num' in the given 'col' causes a clash
 export function hasColClash(board, col, num) {
-	for (let r = 0; r < board.length; r++) {
-		if (getElement(board, r, col) === num) {
-			return true;
-		}
-	}
+	for (let r = 0; r < board.length; r++) {}
 	return false;
 }
killedBy: backtrack case 1 
statusReason: expected '3165784295241396789872465312634157899…' to equal '3165784925291347684876295312634159879…'

[Killed] ConditionalExpression
src/backtrack.js:45:18
 
 // Check if placing 'num' in the given 'col' causes a clash
 export function hasColClash(board, col, num) {
-	for (let r = 0; r < board.length; r++) {
+	for (let r = 0; false; r++) {
 		if (getElement(board, r, col) === num) {
 			return true;
killedBy: backtrack case 1 
statusReason: expected '3165784295241396789872465312634157899…' to equal '3165784925291347684876295312634159879…'

[Killed] ConditionalExpression
src/backtrack.js:46:7
 // Check if placing 'num' in the given 'col' causes a clash
 export function hasColClash(board, col, num) {
 	for (let r = 0; r < board.length; r++) {
-		if (getElement(board, r, col) === num) {
+		if (true) {
 			return true;
 		}
killedBy: backtrack case 1 
statusReason: expected null to equal '3165784925291347684876295312634159879…'

[Killed] ConditionalExpression
src/backtrack.js:46:7
 // Check if placing 'num' in the given 'col' causes a clash
 export function hasColClash(board, col, num) {
 	for (let r = 0; r < board.length; r++) {
-		if (getElement(board, r, col) === num) {
+		if (false) {
 			return true;
 		}
killedBy: backtrack case 1 
statusReason: expected '3165784295241396789872465312634157899…' to equal '3165784925291347684876295312634159879…'

[Killed] BooleanLiteral
src/backtrack.js:47:11
 export function hasColClash(board, col, num) {
 	for (let r = 0; r < board.length; r++) {
 		if (getElement(board, r, col) === num) {
-			return true;
+			return false;
 		}
 	}
killedBy: backtrack case 1 
statusReason: expected '3165784295241396789872465312634157899…' to equal '3165784925291347684876295312634159879…'

[Killed] BlockStatement
src/backtrack.js:54:54
 }
 
 // Check if placing 'num' in the given 'row' and 'col' causes a clash within the square
-export function hasSquareClash(board, row, col, num) {
-	const sqrt = Math.floor(Math.sqrt(board.length));
-	const boxRowStart = row - row % sqrt;
-	const boxColStart = col - col % sqrt;
-
-	for (let r = boxRowStart; r < boxRowStart + sqrt; r++) {
-		for (let c = boxColStart; c < boxColStart + sqrt; c++) {
-			if (getElement(board, r, c) === num) {
-				return true;
-			}
-		}
-	}
-
-	return false;
-}
+export function hasSquareClash(board, row, col, num) {}
 
 // Check if placing 'num' in the given 'row' and 'col' is safe
killedBy: backtrack case 1 
statusReason: expected '3165284975213478692876549316439157829…' to equal '3165784925291347684876295312634159879…'

[Killed] ArithmeticOperator
src/backtrack.js:56:22
 // Check if placing 'num' in the given 'row' and 'col' causes a clash within the square
 export function hasSquareClash(board, row, col, num) {
 	const sqrt = Math.floor(Math.sqrt(board.length));
-	const boxRowStart = row - row % sqrt;
+	const boxRowStart = row + row % sqrt;
 	const boxColStart = col - col % sqrt;
 
killedBy: backtrack case 1 
statusReason: expected null to equal '3165784925291347684876295312634159879…'

[Killed] ArithmeticOperator
src/backtrack.js:56:28
 // Check if placing 'num' in the given 'row' and 'col' causes a clash within the square
 export function hasSquareClash(board, row, col, num) {
 	const sqrt = Math.floor(Math.sqrt(board.length));
-	const boxRowStart = row - row % sqrt;
+	const boxRowStart = row - row * sqrt;
 	const boxColStart = col - col % sqrt;
 
killedBy: backtrack case 1 
statusReason: Index out of bounds

[Killed] ArithmeticOperator
src/backtrack.js:57:22
 export function hasSquareClash(board, row, col, num) {
 	const sqrt = Math.floor(Math.sqrt(board.length));
 	const boxRowStart = row - row % sqrt;
-	const boxColStart = col - col % sqrt;
+	const boxColStart = col + col % sqrt;
 
 	for (let r = boxRowStart; r < boxRowStart + sqrt; r++) {
killedBy: backtrack case 1 
statusReason: Index out of bounds

[Killed] ArithmeticOperator
src/backtrack.js:57:28
 export function hasSquareClash(board, row, col, num) {
 	const sqrt = Math.floor(Math.sqrt(board.length));
 	const boxRowStart = row - row % sqrt;
-	const boxColStart = col - col % sqrt;
+	const boxColStart = col - col * sqrt;
 
 	for (let r = boxRowStart; r < boxRowStart + sqrt; r++) {
killedBy: backtrack case 1 
statusReason: Index out of bounds

[Killed] ConditionalExpression
src/backtrack.js:59:28
 	const boxRowStart = row - row % sqrt;
 	const boxColStart = col - col % sqrt;
 
-	for (let r = boxRowStart; r < boxRowStart + sqrt; r++) {
+	for (let r = boxRowStart; false; r++) {
 		for (let c = boxColStart; c < boxColStart + sqrt; c++) {
 			if (getElement(board, r, c) === num) {
killedBy: backtrack case 1 
statusReason: expected '3165284975213478692876549316439157829…' to equal '3165784925291347684876295312634159879…'

[Killed] EqualityOperator
src/backtrack.js:59:28
 	const boxRowStart = row - row % sqrt;
 	const boxColStart = col - col % sqrt;
 
-	for (let r = boxRowStart; r < boxRowStart + sqrt; r++) {
+	for (let r = boxRowStart; r <= boxRowStart + sqrt; r++) {
 		for (let c = boxColStart; c < boxColStart + sqrt; c++) {
 			if (getElement(board, r, c) === num) {
killedBy: backtrack case 1 
statusReason: expected null to equal '3165784925291347684876295312634159879…'

[Killed] UpdateOperator
src/backtrack.js:60:53
 	const boxColStart = col - col % sqrt;
 
 	for (let r = boxRowStart; r < boxRowStart + sqrt; r++) {
-		for (let c = boxColStart; c < boxColStart + sqrt; c++) {
+		for (let c = boxColStart; c < boxColStart + sqrt; c--) {
 			if (getElement(board, r, c) === num) {
 				return true;
killedBy: backtrack case 1 
statusReason: Index out of bounds

[Killed] EqualityOperator
src/backtrack.js:60:29
 	const boxColStart = col - col % sqrt;
 
 	for (let r = boxRowStart; r < boxRowStart + sqrt; r++) {
-		for (let c = boxColStart; c < boxColStart + sqrt; c++) {
+		for (let c = boxColStart; c >= boxColStart + sqrt; c++) {
 			if (getElement(board, r, c) === num) {
 				return true;
killedBy: backtrack case 1 
statusReason: expected '3165284975213478692876549316439157829…' to equal '3165784925291347684876295312634159879…'

[Killed] ConditionalExpression
src/backtrack.js:61:8
 
 	for (let r = boxRowStart; r < boxRowStart + sqrt; r++) {
 		for (let c = boxColStart; c < boxColStart + sqrt; c++) {
-			if (getElement(board, r, c) === num) {
+			if (true) {
 				return true;
 			}
killedBy: backtrack case 1 
statusReason: expected null to equal '3165784925291347684876295312634159879…'

[Killed] EqualityOperator
src/backtrack.js:61:8
 
 	for (let r = boxRowStart; r < boxRowStart + sqrt; r++) {
 		for (let c = boxColStart; c < boxColStart + sqrt; c++) {
-			if (getElement(board, r, c) === num) {
+			if (getElement(board, r, c) !== num) {
 				return true;
 			}
killedBy: backtrack case 1 
statusReason: expected null to equal '3165784925291347684876295312634159879…'

[Killed] BooleanLiteral
src/backtrack.js:62:12
 	for (let r = boxRowStart; r < boxRowStart + sqrt; r++) {
 		for (let c = boxColStart; c < boxColStart + sqrt; c++) {
 			if (getElement(board, r, c) === num) {
-				return true;
+				return false;
 			}
 		}
killedBy: backtrack case 1 
statusReason: expected '3165284975213478692876549316439157829…' to equal '3165784925291347684876295312634159879…'

[Killed] BlockStatement
src/backtrack.js:71:46
 }
 
 // Check if placing 'num' in the given 'row' and 'col' is safe
-export function isSafe(board, row, col, num) {
-	return !hasRowClash(board, row, num) &&
-		!hasColClash(board, col, num) &&
-		!hasSquareClash(board, row, col, num);
-}
+export function isSafe(board, row, col, num) {}
 
 
killedBy: backtrack case 1 
statusReason: expected null to equal '3165784925291347684876295312634159879…'

[Killed] LogicalOperator
src/backtrack.js:72:9
 
 // Check if placing 'num' in the given 'row' and 'col' is safe
 export function isSafe(board, row, col, num) {
-	return !hasRowClash(board, row, num) &&
-		!hasColClash(board, col, num) &&
-		!hasSquareClash(board, row, col, num);
+	return !hasRowClash(board, row, num) && !hasColClash(board, col, num) || !hasSquareClash(board, row, col, num);
 }
 
killedBy: backtrack case 1 
statusReason: expected '3165184255212346782874569311232141829…' to equal '3165784925291347684876295312634159879…'

[Killed] ConditionalExpression
src/backtrack.js:72:9
 
 // Check if placing 'num' in the given 'row' and 'col' is safe
 export function isSafe(board, row, col, num) {
-	return !hasRowClash(board, row, num) &&
-		!hasColClash(board, col, num) &&
-		!hasSquareClash(board, row, col, num);
+	return false;
 }
 
killedBy: backtrack case 1 
statusReason: expected null to equal '3165784925291347684876295312634159879…'

[Killed] BooleanLiteral
src/backtrack.js:73:3
 // Check if placing 'num' in the given 'row' and 'col' is safe
 export function isSafe(board, row, col, num) {
 	return !hasRowClash(board, row, num) &&
-		!hasColClash(board, col, num) &&
+		hasColClash(board, col, num) &&
 		!hasSquareClash(board, row, col, num);
 }
killedBy: backtrack case 1 
statusReason: expected null to equal '3165784925291347684876295312634159879…'

[Killed] BooleanLiteral
src/backtrack.js:74:3
 export function isSafe(board, row, col, num) {
 	return !hasRowClash(board, row, num) &&
 		!hasColClash(board, col, num) &&
-		!hasSquareClash(board, row, col, num);
+		hasSquareClash(board, row, col, num);
 }
 
killedBy: backtrack case 1 
statusReason: expected null to equal '3165784925291347684876295312634159879…'

[Survived] UnaryOperator
src/backtrack.js:79:12
 
 
 function solveSudoku(board, n) {
-	let row = -1;
+	let row = +1;
 	let col = -1;
 	// let row, col;

[Survived] UnaryOperator
src/backtrack.js:80:12
 
 function solveSudoku(board, n) {
 	let row = -1;
-	let col = -1;
+	let col = +1;
 	// let row, col;
 	let isEmpty = true;

[Killed] BooleanLiteral
src/backtrack.js:82:16
 	let row = -1;
 	let col = -1;
 	// let row, col;
-	let isEmpty = true;
+	let isEmpty = false;
 	for (let i = 0; i < n; i++) {
 		for (let j = 0; j < n; j++) {
killedBy: backtrack case 1 
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] EqualityOperator
src/backtrack.js:83:18
 	let col = -1;
 	// let row, col;
 	let isEmpty = true;
-	for (let i = 0; i < n; i++) {
+	for (let i = 0; i <= n; i++) {
 		for (let j = 0; j < n; j++) {
 			if (getElement(board, i, j) == 0) {
killedBy: backtrack case 1 
statusReason: Index out of bounds

[Killed] BlockStatement
src/backtrack.js:83:30
 	let col = -1;
 	// let row, col;
 	let isEmpty = true;
-	for (let i = 0; i < n; i++) {
-		for (let j = 0; j < n; j++) {
-			if (getElement(board, i, j) == 0) {
-				row = i;
-				col = j;
-
-				// We still have some remaining
-				// missing values in Sudoku
-				isEmpty = false;
-				break;
-			}
-		}
-		if (!isEmpty) {
-			break;
-		}
-	}
+	for (let i = 0; i < n; i++) {}
 
 	// No empty space left
killedBy: backtrack case 1 
statusReason: expected '3065084005200000000870000310030100809…' to equal '3165784925291347684876295312634159879…'

[Killed] ConditionalExpression
src/backtrack.js:84:19
 	// let row, col;
 	let isEmpty = true;
 	for (let i = 0; i < n; i++) {
-		for (let j = 0; j < n; j++) {
+		for (let j = 0; false; j++) {
 			if (getElement(board, i, j) == 0) {
 				row = i;
killedBy: backtrack case 1 
statusReason: expected '3065084005200000000870000310030100809…' to equal '3165784925291347684876295312634159879…'

[Killed] EqualityOperator
src/backtrack.js:84:19
 	// let row, col;
 	let isEmpty = true;
 	for (let i = 0; i < n; i++) {
-		for (let j = 0; j < n; j++) {
+		for (let j = 0; j >= n; j++) {
 			if (getElement(board, i, j) == 0) {
 				row = i;
killedBy: backtrack case 1 
statusReason: expected '3065084005200000000870000310030100809…' to equal '3165784925291347684876295312634159879…'

[Killed] ConditionalExpression
src/backtrack.js:85:8
 	let isEmpty = true;
 	for (let i = 0; i < n; i++) {
 		for (let j = 0; j < n; j++) {
-			if (getElement(board, i, j) == 0) {
+			if (false) {
 				row = i;
 				col = j;
killedBy: backtrack case 1 
statusReason: expected '3065084005200000000870000310030100809…' to equal '3165784925291347684876295312634159879…'

[Killed] ConditionalExpression
src/backtrack.js:85:8
 	let isEmpty = true;
 	for (let i = 0; i < n; i++) {
 		for (let j = 0; j < n; j++) {
-			if (getElement(board, i, j) == 0) {
+			if (true) {
 				row = i;
 				col = j;
killedBy: backtrack case 1 
statusReason: expected null to equal '3165784925291347684876295312634159879…'

[Killed] BooleanLiteral
src/backtrack.js:91:15
 
 				// We still have some remaining
 				// missing values in Sudoku
-				isEmpty = false;
+				isEmpty = true;
 				break;
 			}
killedBy: backtrack case 1 
statusReason: expected '3065084005200000000870000310030100809…' to equal '3165784925291347684876295312634159879…'

[Killed] ConditionalExpression
src/backtrack.js:95:7
 				break;
 			}
 		}
-		if (!isEmpty) {
+		if (true) {
 			break;
 		}
killedBy: backtrack case 1 
statusReason: expected '3165284975200000000870000310030100809…' to equal '3165784925291347684876295312634159879…'

[Survived] BlockStatement
src/backtrack.js:95:17
 				break;
 			}
 		}
-		if (!isEmpty) {
-			break;
-		}
+		if (!isEmpty) {}
 	}
 

[Killed] ConditionalExpression
src/backtrack.js:101:6
 	}
 
 	// No empty space left
-	if (isEmpty) {
+	if (false) {
 		return true;
 	}
killedBy: backtrack case 1 
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/backtrack.js:101:15
 	}
 
 	// No empty space left
-	if (isEmpty) {
-		return true;
-	}
+	if (isEmpty) {}
 
 	// Else for each-row backtrack
killedBy: backtrack case 1 
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BooleanLiteral
src/backtrack.js:102:10
 
 	// No empty space left
 	if (isEmpty) {
-		return true;
+		return false;
 	}
 
killedBy: backtrack case 1 
statusReason: expected null to equal '3165784925291347684876295312634159879…'

[Killed] BlockStatement
src/backtrack.js:106:37
 	}
 
 	// Else for each-row backtrack
-	for (let num = 1; num <= n; num++) {
-		if (isSafe(board, row, col, num)) {
-			// board[row][col] = num;
-			putElement(board,row,col,num);
-			if (solveSudoku(board, n)) {
-
-				// print(board, n);
-				return true;
-			}
-			else {
-
-				// Replace it
-				// board[row][col] = 0;
-				putElement(board,row,col,0);
-			}
-		}
-	}
+	for (let num = 1; num <= n; num++) {}
 	return false;
 }
killedBy: backtrack case 1 
statusReason: expected null to equal '3165784925291347684876295312634159879…'

[Killed] UpdateOperator
src/backtrack.js:106:30
 	}
 
 	// Else for each-row backtrack
-	for (let num = 1; num <= n; num++) {
+	for (let num = 1; num <= n; num--) {
 		if (isSafe(board, row, col, num)) {
 			// board[row][col] = num;
killedBy: backtrack case 1 
statusReason: expected '3165-184-2-352-11-2-3-4-5-6-287-4-5-6…' to equal '3165784925291347684876295312634159879…'

[Killed] ConditionalExpression
src/backtrack.js:107:7
 
 	// Else for each-row backtrack
 	for (let num = 1; num <= n; num++) {
-		if (isSafe(board, row, col, num)) {
+		if (false) {
 			// board[row][col] = num;
 			putElement(board,row,col,num);
killedBy: backtrack case 1 
statusReason: expected null to equal '3165784925291347684876295312634159879…'

[Killed] BlockStatement
src/backtrack.js:107:37
 
 	// Else for each-row backtrack
 	for (let num = 1; num <= n; num++) {
-		if (isSafe(board, row, col, num)) {
-			// board[row][col] = num;
-			putElement(board,row,col,num);
-			if (solveSudoku(board, n)) {
-
-				// print(board, n);
-				return true;
-			}
-			else {
-
-				// Replace it
-				// board[row][col] = 0;
-				putElement(board,row,col,0);
-			}
-		}
+		if (isSafe(board, row, col, num)) {}
 	}
 	return false;
killedBy: backtrack case 1 
statusReason: expected null to equal '3165784925291347684876295312634159879…'

[Killed] ConditionalExpression
src/backtrack.js:110:8
 		if (isSafe(board, row, col, num)) {
 			// board[row][col] = num;
 			putElement(board,row,col,num);
-			if (solveSudoku(board, n)) {
+			if (false) {
 
 				// print(board, n);
killedBy: backtrack case 1 
statusReason: expected null to equal '3165784925291347684876295312634159879…'

[Killed] BlockStatement
src/backtrack.js:110:31
 		if (isSafe(board, row, col, num)) {
 			// board[row][col] = num;
 			putElement(board,row,col,num);
-			if (solveSudoku(board, n)) {
-
-				// print(board, n);
-				return true;
-			}
+			if (solveSudoku(board, n)) {}
 			else {
 
killedBy: backtrack case 1 
statusReason: expected null to equal '3165784925291347684876295312634159879…'

[Killed] BooleanLiteral
src/backtrack.js:113:12
 			if (solveSudoku(board, n)) {
 
 				// print(board, n);
-				return true;
+				return false;
 			}
 			else {
killedBy: backtrack case 1 
statusReason: expected null to equal '3165784925291347684876295312634159879…'

[Killed] BlockStatement
src/backtrack.js:115:9
 				// print(board, n);
 				return true;
 			}
-			else {
-
-				// Replace it
-				// board[row][col] = 0;
-				putElement(board,row,col,0);
-			}
+			else {}
 		}
 	}
killedBy: backtrack case 1 
statusReason: expected null to equal '3165784925291347684876295312634159879…'

[Killed] BlockStatement
src/backtrack.js:126:52
 	return false;
 }
 
-export const sudokuArrayToString = (boardArray) => {
-	let boardString = '';
-
-	for (let i = 0; i < boardArray.length; i++) {
-		for (let j = 0; j < boardArray[i].length; j++) {
-			// boardString += boardArray[i][j];
-			boardString += getElement(boardArray,i,j);
-		}
-	}
-
-	return boardString;
-}
+export const sudokuArrayToString = (boardArray) => {}
 
 export const stringToSudokuArray = (boardString) => {
killedBy: backtrack case atos
statusReason: expected undefined to equal '3065084005200000000870000310030100809…'

[Killed] UpdateOperator
src/backtrack.js:129:41
 export const sudokuArrayToString = (boardArray) => {
 	let boardString = '';
 
-	for (let i = 0; i < boardArray.length; i++) {
+	for (let i = 0; i < boardArray.length; i--) {
 		for (let j = 0; j < boardArray[i].length; j++) {
 			// boardString += boardArray[i][j];
killedBy: backtrack case atos
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] EqualityOperator
src/backtrack.js:129:18
 export const sudokuArrayToString = (boardArray) => {
 	let boardString = '';
 
-	for (let i = 0; i < boardArray.length; i++) {
+	for (let i = 0; i <= boardArray.length; i++) {
 		for (let j = 0; j < boardArray[i].length; j++) {
 			// boardString += boardArray[i][j];
killedBy: backtrack case atos
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/backtrack.js:130:19
 	let boardString = '';
 
 	for (let i = 0; i < boardArray.length; i++) {
-		for (let j = 0; j < boardArray[i].length; j++) {
+		for (let j = 0; false; j++) {
 			// boardString += boardArray[i][j];
 			boardString += getElement(boardArray,i,j);
killedBy: backtrack case atos
statusReason: expected '' to equal '3065084005200000000870000310030100809…'

[Killed] BlockStatement
src/backtrack.js:130:50
 	let boardString = '';
 
 	for (let i = 0; i < boardArray.length; i++) {
-		for (let j = 0; j < boardArray[i].length; j++) {
-			// boardString += boardArray[i][j];
-			boardString += getElement(boardArray,i,j);
-		}
+		for (let j = 0; j < boardArray[i].length; j++) {}
 	}
 
killedBy: backtrack case atos
statusReason: expected '' to equal '3065084005200000000870000310030100809…'

[Killed] AssignmentOperator
src/backtrack.js:132:4
 	for (let i = 0; i < boardArray.length; i++) {
 		for (let j = 0; j < boardArray[i].length; j++) {
 			// boardString += boardArray[i][j];
-			boardString += getElement(boardArray,i,j);
+			boardString -= getElement(boardArray, i, j);
 		}
 	}
killedBy: backtrack case atos
statusReason: expected -153 to equal '3065084005200000000870000310030100809…'

[Killed] BlockStatement
src/backtrack.js:139:53
 	return boardString;
 }
 
-export const stringToSudokuArray = (boardString) => {
-	const boardArray = [];
-	const N = 9
-
-	for (let i = 0; i < N; i++) {
-		const row = boardString.slice(i * N, (i + 1) * N).split('').map(Number);
-		boardArray.push(row);
-	}
-
-	return boardArray;
-}
+export const stringToSudokuArray = (boardString) => {}
 
 export const SudokuBacktrack = (boardString) => {
killedBy: backtrack case stoa
statusReason: expected undefined to deeply equal [ …(9) ]

[Killed] EqualityOperator
src/backtrack.js:143:18
 	const boardArray = [];
 	const N = 9
 
-	for (let i = 0; i < N; i++) {
+	for (let i = 0; i <= N; i++) {
 		const row = boardString.slice(i * N, (i + 1) * N).split('').map(Number);
 		boardArray.push(row);
killedBy: backtrack case stoa
statusReason: expected [ …(10) ] to deeply equal [ …(9) ]

[Killed] ConditionalExpression
src/backtrack.js:143:18
 	const boardArray = [];
 	const N = 9
 
-	for (let i = 0; i < N; i++) {
+	for (let i = 0; false; i++) {
 		const row = boardString.slice(i * N, (i + 1) * N).split('').map(Number);
 		boardArray.push(row);
killedBy: backtrack case stoa
statusReason: expected [] to deeply equal [ …(9) ]
