[Killed] ArithmeticOperator
src/backtrack.js:144:41
 	const N = 9
 
 	for (let i = 0; i < N; i++) {
-		const row = boardString.slice(i * N, (i + 1) * N).split('').map(Number);
+		const row = boardString.slice(i * N, (i - 1) * N).split('').map(Number);
 		boardArray.push(row);
 	}
killedBy: backtrack case stoa
statusReason: expected [ …(9) ] to deeply equal [ …(9) ]

[Killed] MethodExpression
src/backtrack.js:144:15
 	const N = 9
 
 	for (let i = 0; i < N; i++) {
-		const row = boardString.slice(i * N, (i + 1) * N).split('').map(Number);
+		const row = boardString.split('').map(Number);
 		boardArray.push(row);
 	}
killedBy: backtrack case stoa
statusReason: expected [ …(9) ] to deeply equal [ …(9) ]

[Killed] BlockStatement
src/backtrack.js:151:49
 	return boardArray;
 }
 
-export const SudokuBacktrack = (boardString) => {
-	if (boardString.length != 81)
-		return null
-	let board = stringToSudokuArray(boardString);
-	if (solveSudoku(board, 9)) {
-		// Return the solved board
-		return sudokuArrayToString(board);
-	} else {
-		// Return null if no solution
-		return null;
-	}
-}
+export const SudokuBacktrack = (boardString) => {}
 
 // let testInputStrings = [
killedBy: backtrack case 1 
statusReason: expected undefined to equal '3165784925291347684876295312634159879…'

[Killed] ConditionalExpression
src/backtrack.js:152:6
 }
 
 export const SudokuBacktrack = (boardString) => {
-	if (boardString.length != 81)
+	if (true)
 		return null
 	let board = stringToSudokuArray(boardString);
killedBy: backtrack case 1 
statusReason: expected null to equal '3165784925291347684876295312634159879…'

[Killed] ConditionalExpression
src/backtrack.js:152:6
 }
 
 export const SudokuBacktrack = (boardString) => {
-	if (boardString.length != 81)
+	if (false)
 		return null
 	let board = stringToSudokuArray(boardString);
killedBy: backtrack case 3 
statusReason: expected '3165784925291347684876295312634159879…' to equal null

[Killed] ConditionalExpression
src/backtrack.js:155:6
 	if (boardString.length != 81)
 		return null
 	let board = stringToSudokuArray(boardString);
-	if (solveSudoku(board, 9)) {
+	if (false) {
 		// Return the solved board
 		return sudokuArrayToString(board);
killedBy: backtrack case 1 
statusReason: expected null to equal '3165784925291347684876295312634159879…'

[Killed] ConditionalExpression
src/backtrack.js:155:6
 	if (boardString.length != 81)
 		return null
 	let board = stringToSudokuArray(boardString);
-	if (solveSudoku(board, 9)) {
+	if (true) {
 		// Return the solved board
 		return sudokuArrayToString(board);
killedBy: backtrack case 1 
statusReason: expected '3065084005200000000870000310030100809…' to equal '3165784925291347684876295312634159879…'

[Killed] BlockStatement
src/backtrack.js:158:9
 	if (solveSudoku(board, 9)) {
 		// Return the solved board
 		return sudokuArrayToString(board);
-	} else {
-		// Return null if no solution
-		return null;
-	}
+	} else {}
 }
 
killedBy: backtrack case 2 
statusReason: expected undefined to equal null
