[Killed] EqualityOperator
src/bitwise.js:3:3
 export function getElement(board, row, col) {
 	if (
-		row < 0 ||
+		row <= 0 ||
 		row >= board.length ||
 		col < 0 ||
killedBy: bitwise case 1a: getElement 
statusReason: Index out of bounds

[Killed] LogicalOperator
src/bitwise.js:16:3
 
 export function putElement(board, row, col, val) {
 	if (
-		row < 0 ||
-		row >= board.length ||
+		row < 0 && row >= board.length ||
 		col < 0 ||
 		col >= board[0].length
killedBy: bitwise case 1a: putElement
statusReason: expected [Function] to throw error including 'Index out of bounds' but got 'Cannot set properties of undefined (s…'

[Killed] ConditionalExpression
src/bitwise.js:16:3
 
 export function putElement(board, row, col, val) {
 	if (
-		row < 0 ||
-		row >= board.length ||
-		col < 0 ||
-		col >= board[0].length
+		true
 	) {
 		throw new Error("Index out of bounds");
killedBy: bitwise correct putElement
statusReason: Index out of bounds

[Killed] EqualityOperator
src/bitwise.js:17:3
 export function putElement(board, row, col, val) {
 	if (
 		row < 0 ||
-		row >= board.length ||
+		row > board.length ||
 		col < 0 ||
 		col >= board[0].length
killedBy: bitwise case 1a: putElement
statusReason: expected [Function] to throw error including 'Index out of bounds' but got 'Cannot set properties of undefined (s…'

[Killed] BlockStatement
src/bitwise.js:28:33
 	return true;
 }
 
-export const getBox = (i, j) => {
-    if (i < 0 || i >= 9 || j < 0 || j >= 9) {
-        return null; // Return null for out-of-bounds coordinates
-    }
-    return 3 * Math.floor(i / 3) + Math.floor(j / 3);
-}
+export const getBox = (i, j) => {}
 
 export const isSafe = (i, j, number, row, col, box) => {
killedBy: bitwise case 1: solver 
statusReason: expected +0 to equal '3165784925291347684876295312634159879…'

[Killed] ConditionalExpression
src/bitwise.js:29:37
 }
 
 export const getBox = (i, j) => {
-    if (i < 0 || i >= 9 || j < 0 || j >= 9) {
+    if (i < 0 || i >= 9 || j < 0 || false) {
         return null; // Return null for out-of-bounds coordinates
     }
killedBy: bitwise case 4a: getBox 
statusReason: expected 6 to equal null

[Killed] ConditionalExpression
src/bitwise.js:29:9
 }
 
 export const getBox = (i, j) => {
-    if (i < 0 || i >= 9 || j < 0 || j >= 9) {
+    if (false || j >= 9) {
         return null; // Return null for out-of-bounds coordinates
     }
killedBy: bitwise case 1b: getBox 
statusReason: expected -2 to equal null

[Killed] ArithmeticOperator
src/bitwise.js:32:47
     if (i < 0 || i >= 9 || j < 0 || j >= 9) {
         return null; // Return null for out-of-bounds coordinates
     }
-    return 3 * Math.floor(i / 3) + Math.floor(j / 3);
+    return 3 * Math.floor(i / 3) + Math.floor(j * 3);
 }
 
killedBy: bitwise case 1: solver 
statusReason: expected +0 to equal '3165784925291347684876295312634159879…'

[Killed] ArithmeticOperator
src/bitwise.js:32:12
     if (i < 0 || i >= 9 || j < 0 || j >= 9) {
         return null; // Return null for out-of-bounds coordinates
     }
-    return 3 * Math.floor(i / 3) + Math.floor(j / 3);
+    return 3 * Math.floor(i / 3) - Math.floor(j / 3);
 }
 
killedBy: bitwise case 1a: getBox 
statusReason: expected -1 to equal 1

[Killed] BlockStatement
src/bitwise.js:35:56
     return 3 * Math.floor(i / 3) + Math.floor(j / 3);
 }
 
-export const isSafe = (i, j, number, row, col, box) => {
-    return !((row[i] >> number) & 1)
-        && !((col[j] >> number) & 1)
-        && !((box[getBox(i, j)] >> number) & 1);
-}
+export const isSafe = (i, j, number, row, col, box) => {}
 
 export const setCellValue = (grid, i, j, value, row, col, box) => {
killedBy: bitwise case 1: solver 
statusReason: expected +0 to equal '3165784925291347684876295312634159879…'

[Killed] ConditionalExpression
src/bitwise.js:36:12
 }
 
 export const isSafe = (i, j, number, row, col, box) => {
-    return !((row[i] >> number) & 1)
-        && !((col[j] >> number) & 1)
-        && !((box[getBox(i, j)] >> number) & 1);
+    return false;
 }
 
killedBy: bitwise case 1: solver 
statusReason: expected +0 to equal '3165784925291347684876295312634159879…'

[Killed] LogicalOperator
src/bitwise.js:36:12
 }
 
 export const isSafe = (i, j, number, row, col, box) => {
-    return !((row[i] >> number) & 1)
-        && !((col[j] >> number) & 1)
+    return !(row[i] >> number & 1) || !(col[j] >> number & 1)
         && !((box[getBox(i, j)] >> number) & 1);
 }
killedBy: bitwise case 1: solver 
statusReason: expected '3165284265241345789876799312434121829…' to equal '3165784925291347684876295312634159879…'

[Killed] BooleanLiteral
src/bitwise.js:37:12
 
 export const isSafe = (i, j, number, row, col, box) => {
     return !((row[i] >> number) & 1)
-        && !((col[j] >> number) & 1)
+        && col[j] >> number & 1
         && !((box[getBox(i, j)] >> number) & 1);
 }
killedBy: bitwise case 1: solver 
statusReason: expected +0 to equal '3165784925291347684876295312634159879…'

[Killed] BooleanLiteral
src/bitwise.js:38:12
 export const isSafe = (i, j, number, row, col, box) => {
     return !((row[i] >> number) & 1)
         && !((col[j] >> number) & 1)
-        && !((box[getBox(i, j)] >> number) & 1);
+        && box[getBox(i, j)] >> number & 1;
 }
 
killedBy: bitwise case 1: solver 
statusReason: expected +0 to equal '3165784925291347684876295312634159879…'

[Killed] BlockStatement
src/bitwise.js:41:67
         && !((box[getBox(i, j)] >> number) & 1);
 }
 
-export const setCellValue = (grid, i, j, value, row, col, box) => {
-    // grid[i][j] = value;
-    putElement(grid, i, j, value);
-    row[i] |= 1 << value;
-    col[j] |= 1 << value;
-    box[getBox(i, j)] |= 1 << value;
-}
+export const setCellValue = (grid, i, j, value, row, col, box) => {}
 
 export const clearCellValue = (grid, i, j, value, row, col, box) => {
killedBy: bitwise case 1: solver 
statusReason: expected '3065084005200000000870000310030100809…' to equal '3165784925291347684876295312634159879…'

[Killed] AssignmentOperator
src/bitwise.js:44:5
 export const setCellValue = (grid, i, j, value, row, col, box) => {
     // grid[i][j] = value;
     putElement(grid, i, j, value);
-    row[i] |= 1 << value;
+    row[i] &= 1 << value;
     col[j] |= 1 << value;
     box[getBox(i, j)] |= 1 << value;
killedBy: bitwise case 1: solver 
statusReason: expected '3165284265291345974876798312434127829…' to equal '3165784925291347684876295312634159879…'

[Killed] AssignmentOperator
src/bitwise.js:45:5
     // grid[i][j] = value;
     putElement(grid, i, j, value);
     row[i] |= 1 << value;
-    col[j] |= 1 << value;
+    col[j] &= 1 << value;
     box[getBox(i, j)] |= 1 << value;
 }
killedBy: bitwise case 1: solver 
statusReason: expected '3165784295241396789872465312634157899…' to equal '3165784925291347684876295312634159879…'

[Killed] AssignmentOperator
src/bitwise.js:46:5
     putElement(grid, i, j, value);
     row[i] |= 1 << value;
     col[j] |= 1 << value;
-    box[getBox(i, j)] |= 1 << value;
+    box[getBox(i, j)] &= 1 << value;
 }
 
killedBy: bitwise case 1: solver 
statusReason: expected '3165284975213478692876549316439157829…' to equal '3165784925291347684876295312634159879…'

[Killed] BlockStatement
src/bitwise.js:49:69
     box[getBox(i, j)] |= 1 << value;
 }
 
-export const clearCellValue = (grid, i, j, value, row, col, box) => {
-    // grid[i][j] = 0;
-    putElement(grid, i, j, 0);
-    row[i] &= ~(1 << value);
-    col[j] &= ~(1 << value);
-    box[getBox(i, j)] &= ~(1 << value);
-}
+export const clearCellValue = (grid, i, j, value, row, col, box) => {}
 
 export const setInitialValues = (grid, row, col, box) => {
killedBy: bitwise case 1: solver 
statusReason: expected +0 to equal '3165784925291347684876295312634159879…'

[Killed] AssignmentOperator
src/bitwise.js:52:5
 export const clearCellValue = (grid, i, j, value, row, col, box) => {
     // grid[i][j] = 0;
     putElement(grid, i, j, 0);
-    row[i] &= ~(1 << value);
+    row[i] |= ~(1 << value);
     col[j] &= ~(1 << value);
     box[getBox(i, j)] &= ~(1 << value);
killedBy: bitwise case 1: solver 
statusReason: expected +0 to equal '3165784925291347684876295312634159879…'

[Killed] UnaryOperator
src/bitwise.js:52:15
 export const clearCellValue = (grid, i, j, value, row, col, box) => {
     // grid[i][j] = 0;
     putElement(grid, i, j, 0);
-    row[i] &= ~(1 << value);
+    row[i] &= 1 << value;
     col[j] &= ~(1 << value);
     box[getBox(i, j)] &= ~(1 << value);
killedBy: bitwise case 1: solver 
statusReason: expected '3165284975291345624876798312634121839…' to equal '3165784925291347684876295312634159879…'

[Killed] AssignmentOperator
src/bitwise.js:53:5
     // grid[i][j] = 0;
     putElement(grid, i, j, 0);
     row[i] &= ~(1 << value);
-    col[j] &= ~(1 << value);
+    col[j] |= ~(1 << value);
     box[getBox(i, j)] &= ~(1 << value);
 }
killedBy: bitwise case 1: solver 
statusReason: expected +0 to equal '3165784925291347684876295312634159879…'

[Killed] UnaryOperator
src/bitwise.js:53:15
     // grid[i][j] = 0;
     putElement(grid, i, j, 0);
     row[i] &= ~(1 << value);
-    col[j] &= ~(1 << value);
+    col[j] &= 1 << value;
     box[getBox(i, j)] &= ~(1 << value);
 }
killedBy: bitwise case 1: solver 
statusReason: expected '3165784295291346874872965312635147899…' to equal '3165784925291347684876295312634159879…'

[Killed] AssignmentOperator
src/bitwise.js:54:5
     putElement(grid, i, j, 0);
     row[i] &= ~(1 << value);
     col[j] &= ~(1 << value);
-    box[getBox(i, j)] &= ~(1 << value);
+    box[getBox(i, j)] |= ~(1 << value);
 }
 
killedBy: bitwise case 1: solver 
statusReason: expected +0 to equal '3165784925291347684876295312634159879…'

[Timeout] UnaryOperator
src/bitwise.js:54:26
     putElement(grid, i, j, 0);
     row[i] &= ~(1 << value);
     col[j] &= ~(1 << value);
-    box[getBox(i, j)] &= ~(1 << value);
+    box[getBox(i, j)] &= 1 << value;
 }
 

[Killed] BlockStatement
src/bitwise.js:57:58
     box[getBox(i, j)] &= ~(1 << value);
 }
 
-export const setInitialValues = (grid, row, col, box) => {
-    for (let i = 0; i < row.length; i++)
-        for (let j = 0; j < col.length; j++)
-            // if (grid[i][j]) {
-            //     setCellValue(grid, i, j, grid[i][j], row, col, box);
-            // }
-            setCellValue(grid, i, j, getElement(grid, i, j), row, col, box);
-}
+export const setInitialValues = (grid, row, col, box) => {}
 
 export const solveSudoku = (grid, i, j, row, col, box) => {
killedBy: bitwise case 1: solver 
statusReason: expected '3165284345221345673875671311233154869…' to equal '3165784925291347684876295312634159879…'

[Killed] EqualityOperator
src/bitwise.js:58:21
 }
 
 export const setInitialValues = (grid, row, col, box) => {
-    for (let i = 0; i < row.length; i++)
+    for (let i = 0; i >= row.length; i++)
         for (let j = 0; j < col.length; j++)
             // if (grid[i][j]) {
killedBy: bitwise case 1: solver 
statusReason: expected '3165284345221345673875671311233154869…' to equal '3165784925291347684876295312634159879…'

[Killed] ConditionalExpression
src/bitwise.js:58:21
 }
 
 export const setInitialValues = (grid, row, col, box) => {
-    for (let i = 0; i < row.length; i++)
+    for (let i = 0; false; i++)
         for (let j = 0; j < col.length; j++)
             // if (grid[i][j]) {
killedBy: bitwise case 1: solver 
statusReason: expected '3165284345221345673875671311233154869…' to equal '3165784925291347684876295312634159879…'

[Killed] ConditionalExpression
src/bitwise.js:59:25
 
 export const setInitialValues = (grid, row, col, box) => {
     for (let i = 0; i < row.length; i++)
-        for (let j = 0; j < col.length; j++)
+        for (let j = 0; false; j++)
             // if (grid[i][j]) {
             //     setCellValue(grid, i, j, grid[i][j], row, col, box);
killedBy: bitwise case 1: solver 
statusReason: expected '3165284345221345673875671311233154869…' to equal '3165784925291347684876295312634159879…'

[Killed] EqualityOperator
src/bitwise.js:59:25
 
 export const setInitialValues = (grid, row, col, box) => {
     for (let i = 0; i < row.length; i++)
-        for (let j = 0; j < col.length; j++)
+        for (let j = 0; j >= col.length; j++)
             // if (grid[i][j]) {
             //     setCellValue(grid, i, j, grid[i][j], row, col, box);
killedBy: bitwise case 1: solver 
statusReason: expected '3165284345221345673875671311233154869…' to equal '3165784925291347684876295312634159879…'

[Killed] BlockStatement
src/bitwise.js:66:59
             setCellValue(grid, i, j, getElement(grid, i, j), row, col, box);
 }
 
-export const solveSudoku = (grid, i, j, row, col, box) => {
-    if (i === row.length - 1 && j === col.length)
-        return true;
-    if (j === 9) {
-        j = 0;
-        i++;
-    }
-
-    if (grid[i][j])
-        return solveSudoku(grid, i, j + 1, row, col, box);
-
-    for (let nr = 1; nr <= 9; nr++) {
-        if (isSafe(i, j, nr, row, col, box)) {
-            setCellValue(grid, i, j, nr, row, col, box);
-
-            if (solveSudoku(grid, i, j + 1, row, col, box))
-                return true;
-
-            clearCellValue(grid, i, j, nr, row, col, box);
-        }
-    }
-
-    return false;
-}
+export const solveSudoku = (grid, i, j, row, col, box) => {}
 
 export const solveSudokuWrapper = (grid) => {
killedBy: bitwise case 1: solver 
statusReason: expected +0 to equal '3165784925291347684876295312634159879…'

[Killed] ConditionalExpression
src/bitwise.js:67:33
 }
 
 export const solveSudoku = (grid, i, j, row, col, box) => {
-    if (i === row.length - 1 && j === col.length)
+    if (i === row.length - 1 && true)
         return true;
     if (j === 9) {
killedBy: bitwise case 1: solver 
statusReason: expected '3165784925291347684876295312634159879…' to equal '3165784925291347684876295312634159879…'

[Killed] ConditionalExpression
src/bitwise.js:67:9
 }
 
 export const solveSudoku = (grid, i, j, row, col, box) => {
-    if (i === row.length - 1 && j === col.length)
+    if (false)
         return true;
     if (j === 9) {
killedBy: bitwise case 1: solver 
statusReason: Cannot read properties of undefined (reading '0')

[Killed] BooleanLiteral
src/bitwise.js:68:16
 
 export const solveSudoku = (grid, i, j, row, col, box) => {
     if (i === row.length - 1 && j === col.length)
-        return true;
+        return false;
     if (j === 9) {
         j = 0;
killedBy: bitwise case 1: solver 
statusReason: expected +0 to equal '3165784925291347684876295312634159879…'

[Killed] ConditionalExpression
src/bitwise.js:69:9
 export const solveSudoku = (grid, i, j, row, col, box) => {
     if (i === row.length - 1 && j === col.length)
         return true;
-    if (j === 9) {
+    if (true) {
         j = 0;
         i++;
killedBy: bitwise case 1: solver 
statusReason: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
src/bitwise.js:69:18
 export const solveSudoku = (grid, i, j, row, col, box) => {
     if (i === row.length - 1 && j === col.length)
         return true;
-    if (j === 9) {
-        j = 0;
-        i++;
-    }
+    if (j === 9) {}
 
     if (grid[i][j])
killedBy: bitwise case 1: solver 
statusReason: expected +0 to equal '3165784925291347684876295312634159879…'

[Killed] UpdateOperator
src/bitwise.js:71:9
         return true;
     if (j === 9) {
         j = 0;
-        i++;
+        i--;
     }
 
killedBy: bitwise case 1: solver 
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
src/bitwise.js:74:9
         i++;
     }
 
-    if (grid[i][j])
+    if (true)
         return solveSudoku(grid, i, j + 1, row, col, box);
 
killedBy: bitwise case 1: solver 
statusReason: expected '3065084005200000000870000310030100809…' to equal '3165784925291347684876295312634159879…'

[Killed] ConditionalExpression
src/bitwise.js:74:9
         i++;
     }
 
-    if (grid[i][j])
+    if (false)
         return solveSudoku(grid, i, j + 1, row, col, box);
 
killedBy: bitwise case 1: solver 
statusReason: expected +0 to equal '3165784925291347684876295312634159879…'

[Killed] ArithmeticOperator
src/bitwise.js:75:37
     }
 
     if (grid[i][j])
-        return solveSudoku(grid, i, j + 1, row, col, box);
+        return solveSudoku(grid, i, j - 1, row, col, box);
 
     for (let nr = 1; nr <= 9; nr++) {
killedBy: bitwise case 1: solver 
statusReason: Index out of bounds

[Killed] BlockStatement
src/bitwise.js:77:37
     if (grid[i][j])
         return solveSudoku(grid, i, j + 1, row, col, box);
 
-    for (let nr = 1; nr <= 9; nr++) {
-        if (isSafe(i, j, nr, row, col, box)) {
-            setCellValue(grid, i, j, nr, row, col, box);
-
-            if (solveSudoku(grid, i, j + 1, row, col, box))
-                return true;
-
-            clearCellValue(grid, i, j, nr, row, col, box);
-        }
-    }
+    for (let nr = 1; nr <= 9; nr++) {}
 
     return false;
killedBy: bitwise case 1: solver 
statusReason: expected +0 to equal '3165784925291347684876295312634159879…'

[Killed] EqualityOperator
src/bitwise.js:77:22
     if (grid[i][j])
         return solveSudoku(grid, i, j + 1, row, col, box);
 
-    for (let nr = 1; nr <= 9; nr++) {
+    for (let nr = 1; nr < 9; nr++) {
         if (isSafe(i, j, nr, row, col, box)) {
             setCellValue(grid, i, j, nr, row, col, box);
killedBy: bitwise case 1: solver 
statusReason: expected +0 to equal '3165784925291347684876295312634159879…'

[Killed] ConditionalExpression
src/bitwise.js:78:13
         return solveSudoku(grid, i, j + 1, row, col, box);
 
     for (let nr = 1; nr <= 9; nr++) {
-        if (isSafe(i, j, nr, row, col, box)) {
+        if (true) {
             setCellValue(grid, i, j, nr, row, col, box);
 
killedBy: bitwise case 1: solver 
statusReason: expected '3165184115211111111871111311131111819…' to equal '3165784925291347684876295312634159879…'

[Killed] ConditionalExpression
src/bitwise.js:78:13
         return solveSudoku(grid, i, j + 1, row, col, box);
 
     for (let nr = 1; nr <= 9; nr++) {
-        if (isSafe(i, j, nr, row, col, box)) {
+        if (false) {
             setCellValue(grid, i, j, nr, row, col, box);
 
killedBy: bitwise case 1: solver 
statusReason: expected +0 to equal '3165784925291347684876295312634159879…'

[Killed] ConditionalExpression
src/bitwise.js:81:17
         if (isSafe(i, j, nr, row, col, box)) {
             setCellValue(grid, i, j, nr, row, col, box);
 
-            if (solveSudoku(grid, i, j + 1, row, col, box))
+            if (true)
                 return true;
 
killedBy: bitwise case 1: solver 
statusReason: expected '3165084005200000000870000310030100809…' to equal '3165784925291347684876295312634159879…'

[Killed] ConditionalExpression
src/bitwise.js:81:17
         if (isSafe(i, j, nr, row, col, box)) {
             setCellValue(grid, i, j, nr, row, col, box);
 
-            if (solveSudoku(grid, i, j + 1, row, col, box))
+            if (false)
                 return true;
 
killedBy: bitwise case 1: solver 
statusReason: expected +0 to equal '3165784925291347684876295312634159879…'

[Killed] BooleanLiteral
src/bitwise.js:82:24
             setCellValue(grid, i, j, nr, row, col, box);
 
             if (solveSudoku(grid, i, j + 1, row, col, box))
-                return true;
+                return false;
 
             clearCellValue(grid, i, j, nr, row, col, box);
killedBy: bitwise case 1: solver 
statusReason: expected +0 to equal '3165784925291347684876295312634159879…'

[Killed] BlockStatement
src/bitwise.js:91:45
     return false;
 }
 
-export const solveSudokuWrapper = (grid) => {
-    const row = new Array(9).fill(0);
-    const col = new Array(9).fill(0);
-    const box = new Array(9).fill(0);
-    setInitialValues(grid, row, col, box);
-    return solveSudoku(grid, 0, 0, row, col, box) ? grid : null;
-}
+export const solveSudokuWrapper = (grid) => {}
 
 export const sudokuArrayToString = (boardArray) => {
killedBy: bitwise case 1: solver 
statusReason: expected +0 to equal '3165784925291347684876295312634159879…'

[Survived] ArrayDeclaration
src/bitwise.js:94:17
 export const solveSudokuWrapper = (grid) => {
     const row = new Array(9).fill(0);
     const col = new Array(9).fill(0);
-    const box = new Array(9).fill(0);
+    const box = new Array().fill(0);
     setInitialValues(grid, row, col, box);
     return solveSudoku(grid, 0, 0, row, col, box) ? grid : null;

[Killed] BlockStatement
src/bitwise.js:99:52
     return solveSudoku(grid, 0, 0, row, col, box) ? grid : null;
 }
 
-export const sudokuArrayToString = (boardArray) => {
-    let boardString = '';
-
-    for (let i = 0; i < boardArray.length; i++) {
-        for (let j = 0; j < boardArray[i].length; j++) {
-            boardString += getElement(boardArray, i, j);
-        }
-    }
-
-    return boardString;
-}
+export const sudokuArrayToString = (boardArray) => {}
 
 export const stringToSudokuArray = (boardString) => {
killedBy: bitwise case atos
statusReason: expected undefined to equal '3065084005200000000870000310030100809…'

[Killed] StringLiteral
src/bitwise.js:100:23
 }
 
 export const sudokuArrayToString = (boardArray) => {
-    let boardString = '';
+    let boardString = "Stryker was here!";
 
     for (let i = 0; i < boardArray.length; i++) {
killedBy: bitwise case atos
statusReason: expected 'Stryker was here!30650840052000000008…' to equal '3065084005200000000870000310030100809…'

[Killed] EqualityOperator
src/bitwise.js:103:25
     let boardString = '';
 
     for (let i = 0; i < boardArray.length; i++) {
-        for (let j = 0; j < boardArray[i].length; j++) {
+        for (let j = 0; j <= boardArray[i].length; j++) {
             boardString += getElement(boardArray, i, j);
         }
killedBy: bitwise case atos
statusReason: Index out of bounds

[Killed] AssignmentOperator
src/bitwise.js:104:13
 
     for (let i = 0; i < boardArray.length; i++) {
         for (let j = 0; j < boardArray[i].length; j++) {
-            boardString += getElement(boardArray, i, j);
+            boardString -= getElement(boardArray, i, j);
         }
     }
killedBy: bitwise case atos
statusReason: expected -153 to equal '3065084005200000000870000310030100809…'

[Killed] BlockStatement
src/bitwise.js:111:53
     return boardString;
 }
 
-export const stringToSudokuArray = (boardString) => {
-    const boardArray = [];
-
-    for (let i = 0; i < Math.sqrt(boardString.length); i++) {
-        const row = boardString.slice(i * Math.sqrt(boardString.length), (i + 1) * Math.sqrt(boardString.length)).split('').map(Number);
-        boardArray.push(row);
-    }
-
-    return boardArray;
-}
+export const stringToSudokuArray = (boardString) => {}
 
 export const SudokuBitwise = (boardString) => {
killedBy: bitwise case stoa
statusReason: expected undefined to deeply equal [ …(9) ]

[Killed] ArrayDeclaration
src/bitwise.js:112:24
 }
 
 export const stringToSudokuArray = (boardString) => {
-    const boardArray = [];
+    const boardArray = ["Stryker was here"];
 
     for (let i = 0; i < Math.sqrt(boardString.length); i++) {
killedBy: bitwise case stoa
statusReason: expected [ 'Stryker was here', …(9) ] to deeply equal [ …(9) ]

[Killed] EqualityOperator
src/bitwise.js:114:21
 export const stringToSudokuArray = (boardString) => {
     const boardArray = [];
 
-    for (let i = 0; i < Math.sqrt(boardString.length); i++) {
+    for (let i = 0; i >= Math.sqrt(boardString.length); i++) {
         const row = boardString.slice(i * Math.sqrt(boardString.length), (i + 1) * Math.sqrt(boardString.length)).split('').map(Number);
         boardArray.push(row);
killedBy: bitwise case stoa
statusReason: expected [] to deeply equal [ …(9) ]

[Killed] EqualityOperator
src/bitwise.js:114:21
 export const stringToSudokuArray = (boardString) => {
     const boardArray = [];
 
-    for (let i = 0; i < Math.sqrt(boardString.length); i++) {
+    for (let i = 0; i <= Math.sqrt(boardString.length); i++) {
         const row = boardString.slice(i * Math.sqrt(boardString.length), (i + 1) * Math.sqrt(boardString.length)).split('').map(Number);
         boardArray.push(row);
killedBy: bitwise case stoa
statusReason: expected [ …(10) ] to deeply equal [ …(9) ]

[Killed] MethodExpression
src/bitwise.js:115:21
     const boardArray = [];
 
     for (let i = 0; i < Math.sqrt(boardString.length); i++) {
-        const row = boardString.slice(i * Math.sqrt(boardString.length), (i + 1) * Math.sqrt(boardString.length)).split('').map(Number);
+        const row = boardString.split('').map(Number);
         boardArray.push(row);
     }
killedBy: bitwise case stoa
statusReason: expected [ …(9) ] to deeply equal [ …(9) ]

[Killed] ArithmeticOperator
src/bitwise.js:115:74
     const boardArray = [];
 
     for (let i = 0; i < Math.sqrt(boardString.length); i++) {
-        const row = boardString.slice(i * Math.sqrt(boardString.length), (i + 1) * Math.sqrt(boardString.length)).split('').map(Number);
+        const row = boardString.slice(i * Math.sqrt(boardString.length), (i + 1) / Math.sqrt(boardString.length)).split('').map(Number);
         boardArray.push(row);
     }
killedBy: bitwise case stoa
statusReason: expected [ [], [], [], [], [], [], [], [], [] ] to deeply equal [ …(9) ]

[Killed] BlockStatement
src/bitwise.js:122:47
     return boardArray;
 }
 
-export const SudokuBitwise = (boardString) => {
-    if (boardString.length != 81)
-        return -1
-
-    let grid = stringToSudokuArray(boardString);
-    if (solveSudokuWrapper(grid, 0, 0))
-        return sudokuArrayToString(grid)
-    else
-        return 0
-}
+export const SudokuBitwise = (boardString) => {}
 
killedBy: bitwise case 1: solver 
statusReason: expected undefined to equal '3165784925291347684876295312634159879…'

[Killed] EqualityOperator
src/bitwise.js:123:9
 }
 
 export const SudokuBitwise = (boardString) => {
-    if (boardString.length != 81)
+    if (boardString.length == 81)
         return -1
 
killedBy: bitwise case 1: solver 
statusReason: expected -1 to equal '3165784925291347684876295312634159879…'

[Killed] ConditionalExpression
src/bitwise.js:123:9
 }
 
 export const SudokuBitwise = (boardString) => {
-    if (boardString.length != 81)
+    if (false)
         return -1
 
killedBy: bitwise case 3: solver 
statusReason: expected +0 to equal -1

[Killed] UnaryOperator
src/bitwise.js:124:16
 
 export const SudokuBitwise = (boardString) => {
     if (boardString.length != 81)
-        return -1
+        return +1
 
     let grid = stringToSudokuArray(boardString);
killedBy: bitwise case 3: solver 
statusReason: expected 1 to equal -1

[Killed] ConditionalExpression
src/bitwise.js:127:9
         return -1
 
     let grid = stringToSudokuArray(boardString);
-    if (solveSudokuWrapper(grid, 0, 0))
+    if (true)
         return sudokuArrayToString(grid)
     else
killedBy: bitwise case 1: solver 
statusReason: expected '3065084005200000000870000310030100809…' to equal '3165784925291347684876295312634159879…'

[Killed] ConditionalExpression
src/bitwise.js:127:9
         return -1
 
     let grid = stringToSudokuArray(boardString);
-    if (solveSudokuWrapper(grid, 0, 0))
+    if (false)
         return sudokuArrayToString(grid)
     else
killedBy: bitwise case 1: solver 
statusReason: expected +0 to equal '3165784925291347684876295312634159879…'
