[Killed] LogicalOperator
src/naive.js:20:3
 
 export function putElement(board, row, col, val) {
 	if (
-		row < 0 ||
-		row >= board.length ||
-		col < 0 ||
+		(row < 0 || row >= board.length) && col < 0 ||
 		col >= board[0].length
 	) {
killedBy: naive case 1a: putElement
statusReason: expected [Function] to throw error including 'Index out of bounds' but got 'Cannot set properties of undefined (s…'

[Killed] EqualityOperator
src/naive.js:45:6
 	indexed matrix) ,
 	we are returning true to avoid further
 	backtracking	 */
-	if (row == N - 1 && col == N)
+	if (row != N - 1 && col == N)
 		return true;
 
killedBy: naive case 1 
statusReason: expected '3165284975200000000870000310030100809…' to equal '3165784925291347684876295312634159879…'

[Killed] LogicalOperator
src/naive.js:45:6
 	indexed matrix) ,
 	we are returning true to avoid further
 	backtracking	 */
-	if (row == N - 1 && col == N)
+	if (row == N - 1 || col == N)
 		return true;
 
killedBy: naive case 1 
statusReason: expected '3165284975200000000870000310030100809…' to equal '3165784925291347684876295312634159879…'

[Killed] BooleanLiteral
src/naive.js:46:10
 	we are returning true to avoid further
 	backtracking	 */
 	if (row == N - 1 && col == N)
-		return true;
+		return false;
 
 	// Check if column value becomes 9 ,
killedBy: naive case 1 
statusReason: expected null to equal '3165784925291347684876295312634159879…'

[Killed] ConditionalExpression
src/naive.js:51:6
 	// Check if column value becomes 9 ,
 	// we move to next row
 	// and column start from 0
-	if (col == N)
+	if (true)
 	{
 		row++;
killedBy: naive case 1 
statusReason: Index out of bounds

[Killed] ConditionalExpression
src/naive.js:51:6
 	// Check if column value becomes 9 ,
 	// we move to next row
 	// and column start from 0
-	if (col == N)
+	if (false)
 	{
 		row++;
killedBy: naive case 1 
statusReason: Index out of bounds

[Killed] BlockStatement
src/naive.js:52:2
 	// we move to next row
 	// and column start from 0
 	if (col == N)
-	{
-		row++;
-		col = 0;
-	}
+	{}
 
 	// Check if the current position
killedBy: naive case 1 
statusReason: Index out of bounds

[Killed] UpdateOperator
src/naive.js:53:3
 	// and column start from 0
 	if (col == N)
 	{
-		row++;
+		row--;
 		col = 0;
 	}
killedBy: naive case 1 
statusReason: Index out of bounds

[Killed] ConditionalExpression
src/naive.js:61:6
 	// of the grid already
 	// contains value >0, we iterate
 	// for next column
-	if (getElement(grid,row,col) != 0)
+	if (true)
 		return solveSudoku(grid, row, col + 1);
 
killedBy: naive case 1 
statusReason: expected '3065084005200000000870000310030100809…' to equal '3165784925291347684876295312634159879…'

[Killed] ConditionalExpression
src/naive.js:61:6
 	// of the grid already
 	// contains value >0, we iterate
 	// for next column
-	if (getElement(grid,row,col) != 0)
+	if (false)
 		return solveSudoku(grid, row, col + 1);
 
killedBy: naive case 1 
statusReason: expected '3165274984781395265296841372614759839…' to equal '3165784925291347684876295312634159879…'

[Killed] ArithmeticOperator
src/naive.js:62:33
 	// contains value >0, we iterate
 	// for next column
 	if (getElement(grid,row,col) != 0)
-		return solveSudoku(grid, row, col + 1);
+		return solveSudoku(grid, row, col - 1);
 
 	for(let num = 1; num < 10; num++)
killedBy: naive case 1 
statusReason: Index out of bounds

[Killed] UpdateOperator
src/naive.js:64:29
 	if (getElement(grid,row,col) != 0)
 		return solveSudoku(grid, row, col + 1);
 
-	for(let num = 1; num < 10; num++)
+	for(let num = 1; num < 10; num--)
 	{
 		
killedBy: naive case 1 
statusReason: expected '3165-184-2-352-11-2-3-4-5-6-287-4-5-6…' to equal '3165784925291347684876295312634159879…'

[Killed] ConditionalExpression
src/naive.js:64:19
 	if (getElement(grid,row,col) != 0)
 		return solveSudoku(grid, row, col + 1);
 
-	for(let num = 1; num < 10; num++)
+	for(let num = 1; false; num++)
 	{
 		
killedBy: naive case 1 
statusReason: expected null to equal '3165784925291347684876295312634159879…'

[Killed] ConditionalExpression
src/naive.js:70:7
 		// Check if it is safe to place
 		// the num (1-9) in the given 
 		// row ,col ->we move to next column
-		if (isSafe(grid, row, col, num))
+		if (false)
 		{
 			
killedBy: naive case 1 
statusReason: expected null to equal '3165784925291347684876295312634159879…'

[Killed] ConditionalExpression
src/naive.js:70:7
 		// Check if it is safe to place
 		// the num (1-9) in the given 
 		// row ,col ->we move to next column
-		if (isSafe(grid, row, col, num))
+		if (true)
 		{
 			
killedBy: naive case 1 
statusReason: expected '3165184115211111111871111311131111819…' to equal '3165784925291347684876295312634159879…'

[Killed] BlockStatement
src/naive.js:71:3
 		// the num (1-9) in the given 
 		// row ,col ->we move to next column
 		if (isSafe(grid, row, col, num))
-		{
-			
-			/* assigning the num in the current
-			(row,col) position of the grid and
-			assuming our assigned num in the position
-			is correct */
-			putElement(grid,row,col,num);
-
-			// Checking for next
-			// possibility with next column
-			if (solveSudoku(grid, row, col + 1))
-				return true;
-		}
+		{}
 		
 		/* removing the assigned num , since our
killedBy: naive case 1 
statusReason: expected null to equal '3165784925291347684876295312634159879…'

[Killed] ConditionalExpression
src/naive.js:81:8
 
 			// Checking for next
 			// possibility with next column
-			if (solveSudoku(grid, row, col + 1))
+			if (false)
 				return true;
 		}
killedBy: naive case 1 
statusReason: expected null to equal '3165784925291347684876295312634159879…'

[Killed] ConditionalExpression
src/naive.js:81:8
 
 			// Checking for next
 			// possibility with next column
-			if (solveSudoku(grid, row, col + 1))
+			if (true)
 				return true;
 		}
killedBy: naive case 1 
statusReason: expected '3165084005200000000870000310030100809…' to equal '3165784925291347684876295312634159879…'

[Killed] BooleanLiteral
src/naive.js:82:12
 			// Checking for next
 			// possibility with next column
 			if (solveSudoku(grid, row, col + 1))
-				return true;
+				return false;
 		}
 		
killedBy: naive case 1 
statusReason: expected null to equal '3165784925291347684876295312634159879…'

[Killed] EqualityOperator
src/naive.js:103:17
 	// Check if we find the same num
 	// in the similar row , we
 	// return false
-	for(let x = 0; x<9; x++)
+	for(let x = 0; x <= 9; x++)
 		if (getElement(grid,row,x) == num)
 			return false;
killedBy: naive case 1 
statusReason: Index out of bounds

[Killed] ConditionalExpression
src/naive.js:103:17
 	// Check if we find the same num
 	// in the similar row , we
 	// return false
-	for(let x = 0; x<9; x++)
+	for(let x = 0; false; x++)
 		if (getElement(grid,row,x) == num)
 			return false;
killedBy: naive case 1 
statusReason: expected '3165284265291345974876798312434127829…' to equal '3165784925291347684876295312634159879…'

[Killed] ConditionalExpression
src/naive.js:104:7
 	// in the similar row , we
 	// return false
 	for(let x = 0; x<9; x++)
-		if (getElement(grid,row,x) == num)
+		if (true)
 			return false;
 
killedBy: naive case 1 
statusReason: expected null to equal '3165784925291347684876295312634159879…'

[Killed] ConditionalExpression
src/naive.js:104:7
 	// in the similar row , we
 	// return false
 	for(let x = 0; x<9; x++)
-		if (getElement(grid,row,x) == num)
+		if (false)
 			return false;
 
killedBy: naive case 1 
statusReason: expected '3165284265291345974876798312434127829…' to equal '3165784925291347684876295312634159879…'

[Killed] BooleanLiteral
src/naive.js:105:11
 	// return false
 	for(let x = 0; x<9; x++)
 		if (getElement(grid,row,x) == num)
-			return false;
+			return true;
 
 	// Check if we find the same num
killedBy: naive case 1 
statusReason: expected '3165184115222222221871111311131111819…' to equal '3165784925291347684876295312634159879…'

[Killed] ConditionalExpression
src/naive.js:110:17
 	// Check if we find the same num
 	// in the similar column ,
 	// we return false
-	for(let x = 0; x<9; x++)
+	for(let x = 0; false; x++)
 		if (getElement(grid,x,col) == num)
 			return false;
killedBy: naive case 1 
statusReason: expected '3165784295241396789872465312634157899…' to equal '3165784925291347684876295312634159879…'

[Killed] EqualityOperator
src/naive.js:110:17
 	// Check if we find the same num
 	// in the similar column ,
 	// we return false
-	for(let x = 0; x<9; x++)
+	for(let x = 0; x <= 9; x++)
 		if (getElement(grid,x,col) == num)
 			return false;
killedBy: naive case 1 
statusReason: Index out of bounds

[Killed] EqualityOperator
src/naive.js:111:7
 	// in the similar column ,
 	// we return false
 	for(let x = 0; x<9; x++)
-		if (getElement(grid,x,col) == num)
+		if (getElement(grid, x, col) != num)
 			return false;
 
killedBy: naive case 1 
statusReason: expected null to equal '3165784925291347684876295312634159879…'

[Killed] ConditionalExpression
src/naive.js:111:7
 	// in the similar column ,
 	// we return false
 	for(let x = 0; x<9; x++)
-		if (getElement(grid,x,col) == num)
+		if (false)
 			return false;
 
killedBy: naive case 1 
statusReason: expected '3165784295241396789872465312634157899…' to equal '3165784925291347684876295312634159879…'

[Killed] BooleanLiteral
src/naive.js:112:11
 	// we return false
 	for(let x = 0; x<9; x++)
 		if (getElement(grid,x,col) == num)
-			return false;
+			return true;
 
 	// Check if we find the same num
killedBy: naive case 1 
statusReason: expected '3165284795231468794872695312435167899…' to equal '3165784925291347684876295312634159879…'

[Killed] ArithmeticOperator
src/naive.js:117:17
 	// Check if we find the same num
 	// in the particular 3*3
 	// matrix, we return false
-	let startRow = row - row % 3, 
+	let startRow = row + row % 3, 
 		startCol = col - col % 3;
 		
killedBy: naive case 1 
statusReason: expected null to equal '3165784925291347684876295312634159879…'

[Killed] ArithmeticOperator
src/naive.js:117:23
 	// Check if we find the same num
 	// in the particular 3*3
 	// matrix, we return false
-	let startRow = row - row % 3, 
+	let startRow = row - row * 3, 
 		startCol = col - col % 3;
 		
killedBy: naive case 1 
statusReason: Index out of bounds

[Killed] ArithmeticOperator
src/naive.js:118:14
 	// in the particular 3*3
 	// matrix, we return false
 	let startRow = row - row % 3, 
-		startCol = col - col % 3;
+		startCol = col + col % 3;
 		
 	for(let i = 0; i < 3; i++)
killedBy: naive case 1 
statusReason: Index out of bounds

[Killed] ArithmeticOperator
src/naive.js:118:20
 	// in the particular 3*3
 	// matrix, we return false
 	let startRow = row - row % 3, 
-		startCol = col - col % 3;
+		startCol = col - col * 3;
 		
 	for(let i = 0; i < 3; i++)
killedBy: naive case 1 
statusReason: Index out of bounds

[Killed] EqualityOperator
src/naive.js:120:17
 	let startRow = row - row % 3, 
 		startCol = col - col % 3;
 		
-	for(let i = 0; i < 3; i++)
+	for(let i = 0; i <= 3; i++)
 		for(let j = 0; j < 3; j++)
 			if (getElement(grid, i + startRow, j + startCol) == num)
killedBy: naive case 1 
statusReason: expected null to equal '3165784925291347684876295312634159879…'

[Killed] UpdateOperator
src/naive.js:120:24
 	let startRow = row - row % 3, 
 		startCol = col - col % 3;
 		
-	for(let i = 0; i < 3; i++)
+	for(let i = 0; i < 3; i--)
 		for(let j = 0; j < 3; j++)
 			if (getElement(grid, i + startRow, j + startCol) == num)
killedBy: naive case 1 
statusReason: Index out of bounds

[Killed] EqualityOperator
src/naive.js:121:18
 		startCol = col - col % 3;
 		
 	for(let i = 0; i < 3; i++)
-		for(let j = 0; j < 3; j++)
+		for(let j = 0; j >= 3; j++)
 			if (getElement(grid, i + startRow, j + startCol) == num)
 				return false;
killedBy: naive case 1 
statusReason: expected '3165284975213478692876549316439157829…' to equal '3165784925291347684876295312634159879…'

[Killed] UpdateOperator
src/naive.js:121:25
 		startCol = col - col % 3;
 		
 	for(let i = 0; i < 3; i++)
-		for(let j = 0; j < 3; j++)
+		for(let j = 0; j < 3; j--)
 			if (getElement(grid, i + startRow, j + startCol) == num)
 				return false;
killedBy: naive case 1 
statusReason: Index out of bounds

[Killed] ArithmeticOperator
src/naive.js:122:25
 		
 	for(let i = 0; i < 3; i++)
 		for(let j = 0; j < 3; j++)
-			if (getElement(grid, i + startRow, j + startCol) == num)
+			if (getElement(grid, i - startRow, j + startCol) == num)
 				return false;
 
killedBy: naive case 1 
statusReason: Index out of bounds

[Killed] ConditionalExpression
src/naive.js:122:8
 		
 	for(let i = 0; i < 3; i++)
 		for(let j = 0; j < 3; j++)
-			if (getElement(grid, i + startRow, j + startCol) == num)
+			if (true)
 				return false;
 
killedBy: naive case 1 
statusReason: expected null to equal '3165784925291347684876295312634159879…'

[Killed] BooleanLiteral
src/naive.js:123:12
 	for(let i = 0; i < 3; i++)
 		for(let j = 0; j < 3; j++)
 			if (getElement(grid, i + startRow, j + startCol) == num)
-				return false;
+				return true;
 
 	return true;
killedBy: naive case 1 
statusReason: expected '3165284975213478692876549316439157829…' to equal '3165784925291347684876295312634159879…'

[Killed] BlockStatement
src/naive.js:129:52
 }
 
 // Driver Code
-export const sudokuArrayToString = (boardArray) => {
-	let boardString = '';
-	
-	for (let i = 0; i < boardArray.length; i++) {
-	  for (let j = 0; j < boardArray[i].length; j++) {
-		boardString += getElement(boardArray,i,j);
-	  }
-	}
-  
-	return boardString;
-  }
+export const sudokuArrayToString = (boardArray) => {}
   
 export const stringToSudokuArray = (boardString) => {
killedBy: naive case atos
statusReason: expected undefined to equal '3065084005200000000870000310030100809…'

[Killed] EqualityOperator
src/naive.js:132:18
 export const sudokuArrayToString = (boardArray) => {
 	let boardString = '';
 	
-	for (let i = 0; i < boardArray.length; i++) {
+	for (let i = 0; i >= boardArray.length; i++) {
 	  for (let j = 0; j < boardArray[i].length; j++) {
 		boardString += getElement(boardArray,i,j);
killedBy: naive case atos
statusReason: expected '' to equal '3065084005200000000870000310030100809…'

[Killed] EqualityOperator
src/naive.js:145:18
 	const boardArray = [];
 	const N = 9
 
-	for (let i = 0; i < N; i++) {
+	for (let i = 0; i >= N; i++) {
 		const row = boardString.slice(i * N, (i + 1) * N).split('').map(Number);
 		boardArray.push(row);
killedBy: naive case stoa
statusReason: expected [] to deeply equal [ …(9) ]

[Killed] ArithmeticOperator
src/naive.js:146:33
 	const N = 9
 
 	for (let i = 0; i < N; i++) {
-		const row = boardString.slice(i * N, (i + 1) * N).split('').map(Number);
+		const row = boardString.slice(i / N, (i + 1) * N).split('').map(Number);
 		boardArray.push(row);
 	}
killedBy: naive case stoa
statusReason: expected [ …(9) ] to deeply equal [ …(9) ]

[Killed] BlockStatement
src/naive.js:153:45
 	return boardArray;
 }
 
-export const SudokuNaive = (boardString) => {
-	let board = stringToSudokuArray(boardString);
-    if (solveSudoku(board,0, 0)) {
-        // Return the solved board
-        return sudokuArrayToString(board);
-    } else {
-        // Return null if no solution
-        return null;
-    }
-}
+export const SudokuNaive = (boardString) => {}
 
killedBy: naive case 1 
statusReason: expected undefined to equal '3165784925291347684876295312634159879…'

[Killed] ConditionalExpression
src/naive.js:155:9
 
 export const SudokuNaive = (boardString) => {
 	let board = stringToSudokuArray(boardString);
-    if (solveSudoku(board,0, 0)) {
+    if (false) {
         // Return the solved board
         return sudokuArrayToString(board);
killedBy: naive case 1 
statusReason: expected null to equal '3165784925291347684876295312634159879…'

[Killed] ConditionalExpression
src/naive.js:155:9
 
 export const SudokuNaive = (boardString) => {
 	let board = stringToSudokuArray(boardString);
-    if (solveSudoku(board,0, 0)) {
+    if (true) {
         // Return the solved board
         return sudokuArrayToString(board);
killedBy: naive case 1 
statusReason: expected '3065084005200000000870000310030100809…' to equal '3165784925291347684876295312634159879…'
