[Killed] ConditionalExpression
src/backtrack.js:8:3
 
 export function getElement(board, row, col) {
 	if (
-		row < 0 ||
-		row >= board.length ||
+		false ||
 		col < 0 ||
 		col >= board[0].length
killedBy: backtrack correct getElement
statusReason: expected 42 to equal 6

[Killed] BooleanLiteral
src/backtrack.js:82:16
 	// let row = -1;
 	// let col = -1;
 	let row, col;
-	let isEmpty = true;
+	let isEmpty = false;
 	for (let i = 0; i < n; i++) {
 		for (let j = 0; j < n; j++) {
killedBy: backtrack case 0
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/backtrack.js:83:30
 	// let col = -1;
 	let row, col;
 	let isEmpty = true;
-	for (let i = 0; i < n; i++) {
-		for (let j = 0; j < n; j++) {
-			if (getElement(board, i, j) == 0) {
-				row = i;
-				col = j;
-
-				// We still have some remaining
-				// missing values in Sudoku
-				isEmpty = false;
-				break;
-			}
-		}
-		// if (!isEmpty) {
-		// 	break;
-		// }
-	}
+	for (let i = 0; i < n; i++) {}
 
 	// No empty space left
killedBy: backtrack case 0
statusReason: expected false to equal true
