[Killed] ConditionalExpression
src/bitwise.js:29:9
 }
 
 export const getBox = (i, j) => {
-    if (i < 0 || i >= 9 || j < 0 || j >= 9) {
+    if (false) {
         return null; // Return null for out-of-bounds coordinates
     }
killedBy: bitwise case 1b: getBox 
statusReason: expected -2 to equal null
