[Killed] EqualityOperator
src/naive.js:104:7
 	// in the similar row , we
 	// return false
 	for(let x = 0; x<9; x++)
-		if (getElement(grid,row,x) == num)
+		if (getElement(grid, row, x) != num)
 			return false;
 
killedBy: naive case 0
statusReason: Cannot read properties of null (reading 'slice')
